Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Using this function you can retrieve the index value of the tile set resource assigned to a given tile map element on a layer.
zh_cn: 使用此函数，您可以检索分配给图层上给定tile map元素的图块集资源的索引值。

source: Using this function you can retrieve the tile data from a cell of the tile map element.
zh_cn: 使用此函数，您可以从 tile map 元素的单元中检索数据。

source: Using this function you can retrieve the tile data from a position (within the room) of the tile map element.
zh_cn: 使用此函数，您可以从tile map元素的某个位置(在房间内)检索tile数据。

source: Using this function you can retrieve the width (in cells) of the tile map element.
zh_cn: 使用此函数可以检索tile map元素的宽度(以单元格为单位)。

source: Using this function you can retrieve the width (in pixels) of each tile cell of the tile map element.
zh_cn: 使用此函数，可以检索tile map元素的每个图格的宽度(以像素为单位)。

source: Using this function you can retrieve the x position (within the room) of the tile map element.
zh_cn: 使用此函数，您可以检索tile map元素的x位置(在房间内)。

source: Using this function you can retrieve the x-axis position of an individual tile map cell by giving the relative x-axis position within the room.
zh_cn: 通过此函数，您可以通过给出房间内的相对x轴位置来检索单个图块地图单元的x轴位置。

source: Using this function you can retrieve the y position (within the room) of the tile map element.
zh_cn: 使用此函数，您可以检索tile map元素的y位置(在房间内)。

source: Using this function you can retrieve the y-axis position of an individual tile map cell by giving the relative y-axis position within the room.
zh_cn: 使用此函数，您可以通过给出房间内的相对y轴位置来检索单个瓷砖地图单元格的y轴位置。

source: Using this function you can set the sprite index of the background element.
zh_cn: 使用此函数你可以设置背景元素的精灵索引。

source: Using this function you can toggle a background element sprite to stretch to fit the room or remain at 1:1 with the resolution.
zh_cn: 通过此函数，您可以切换背景元素精灵，以拉伸到适合房间或保持1:1的分辨率。

source: Using this function you can toggle a background elements visibility.
zh_cn: 通过此函数，您可以切换背景元素的可见性。

source: Usually this event means that clients are in inconsistent state.
zh_cn: 通常，此事件意味着客户端处于不一致状态。

source: Value for the global volume (0 to 1).
zh_cn: 全局音量的值(0到1)。

source: Value for the music volume.
zh_cn: 音乐音量的值。

source: Values to be replaced on the format string (non-strings will be converted to strings).
zh_cn: 要在格式字符串上替换的值（非字符串将转换为字符串）。

source: Values to replace the placeholders with.
zh_cn: 替换占位符的值。

source: Vertical alignment.
zh_cn: 垂直对齐。

source: Vertical position of the cell in the grid
zh_cn: 网格中单元格的垂直位置

source: Viscous particles will clump and stick together more.
zh_cn: 粘性颗粒将更容易结块和粘在一起。

source: Visibility toggle (true is visible and false is invisible)
zh_cn: 可见性切换(true为可见，false为不可见)

source: Volume-id files
zh_cn: Volume-id 文件

source: Vsync timing is the main timing method (default for all supported platforms)
zh_cn: 垂直同步计时是主要的计时方法(所有支持的平台默认)

source: We can use the function physics_fixture_set_angular_damping() in GameMaker to simulate this effect and reduce the velocity of rotation of instances in the physics world, as, without it, any rotating instance would continue to rotate infinitely.
zh_cn: 我们可以使用GameMaker中的physics_fixture_set_angular_damping()函数来模拟这种效果，并减少物理世界中实例的旋转速度，因为如果没有它，任何旋转实例都将继续无限旋转。

source: Web event
zh_cn: Web事件

source: Well, at the start of each area, you can store the random seed with this function and so every time you need to go back there, you can use random_set_seed() to set the seed to what it was previously and so force GameMaker to reproduce the same set of "random" functions that it used previously.
zh_cn: 在每个区域的开始，你可以使用此函数存储随机种子，所以每次你需要回到那里，你可以使用random_set_seed()设置种子为它之前的样子，从而迫使GameMaker重新生成它之前使用的相同的"随机"函数集。

source: Well, you could code the movement system twice, but that is a bit complicated and thankfully redundant as this function permits you to "map" one key to another and so any input from either key will be interpreted as the same.
zh_cn: 好吧，你可以编写两次移动系统代码，但这有点复杂，谢天谢地，因为此函数允许你将一个键"映射"到另一个键，所以来自两个键的任何输入都将被解释为相同的。

source: What kind of bounding box to use.
zh_cn: 使用什么样的边界框。

source: What this basically means is that you give the number of simultaneous sounds that can be played at any one time, and if the number exceeds the amount, those sounds with a lower priority are stopped to free up a channel for the sounds with a higher priority.
zh_cn: 这基本上意味着，你给出了可以在任何时间播放的同时播放的声音的数量，如果数量超过了这个数量，那些优先级较低的声音就会停止，为优先级较高的声音腾出通道。

source: What this means is that it returns the actual device definition of the x position that is being touched, not the GameMaker one, and as such will ignore things like view position and scaling.
zh_cn: 这意味着它返回被触摸的x位置的实际设备定义，而不是GameMaker的定义，因此将忽略视图位置和缩放等内容。

source: What this means is that it returns the actual device definition of the y position that is being touched, not the GameMaker one, and as such will ignore things like view position and scaling.
zh_cn: 这意味着它返回被触摸的y位置的实际设备定义，而不是GameMaker的定义，因此将忽略视图位置和缩放等内容。

source: What this means is that the strength and direction of the force are calculated based on the origin (or the position if it has no sprite) of the instance, without taking into consideration the direction or rotation it may have in the game room or physics world.
zh_cn: 这意味着力的强度和方向是基于实例的原点(或者位置，如果它没有精灵)计算的，而不考虑它在游戏室或物理世界中可能具有的方向或旋转。

source: What this means is that the strength and direction of the impulse are calculated based on the origin (or the position if it has no sprite) of the instance, without taking into consideration the direction or rotation it may have in the game room or physics world.
zh_cn: 这意味着脉冲的强度和方向是基于实例的原点(或者位置，如果它没有精灵的话)计算的，而不考虑它在游戏室或物理世界中可能具有的方向或旋转。

source: What to do when the end of the path is reached (see the constants listed below).
zh_cn: 到达路径末尾时要做什么(参见下面列出的常量)。

source: What to multiply the current horizontal scale by.
zh_cn: 用什么乘以当前的横向缩放。

source: What to multiply the current vertical scale by.
zh_cn: 用什么乘以当前的纵向缩放。

source: When GameMaker goes to draw a pixel there is a source colour (the colour of the pixel we're going to draw) and a destination colour(the colour that's already in the pixel we're drawing to), so when determining the new colour of the pixel, the source and destination colours are calculated according to the chosen blend mode.
zh_cn: 当GameMaker绘制一个像素时，有一个源颜色(我们将要绘制的像素的颜色)和一个目标颜色(我们要绘制的像素中的已经存在的颜色)，所以当确定像素的新颜色时，源和目标颜色将根据所选择的混合模式计算。

source: When GameMaker goes to draw a pixel there is a source colour (the colour of the pixel we're going to draw) and a destination colour (the colour that's already in the pixel we're drawing to), so when determining the new colour of the pixel, the source and destination colours are calculated according to the chosen blend mode.
zh_cn: 当GameMaker绘制一个像素时，有一个源颜色(我们将要绘制的像素的颜色)和一个目标颜色(我们要绘制的像素中的已经存在的颜色)，所以当确定像素的新颜色时，源和目标颜色将根据所选择的混合模式计算。

source: When a path is created, its orientation is the default 0 degrees, but you can set this value to anything you wish using this.
zh_cn: 创建路径时，它的方向是默认的0度，但是您可以使用它将这个值设置为您想要的任何值。

source: When adding a function to a layer, in this way it will be run at the start of each of the different draw events so you may want to check in the function assigned which event is currently rendering and adapt the code to suit.
zh_cn: 当添加一个函数到一个层时，这样它将在每个不同的绘制事件开始时运行，所以你可能想要检查当前渲染的事件所分配的函数，并修改代码以适应它。

source: When adding a function to a layer in this way, it will be run at the end of each of the different draw events so you may want to check in the function assigned which event is currently finished rendering and adapt the code to suit.
zh_cn: 当以这种方式添加一个函数到一个层时，它将在每个不同的绘制事件结束时运行，所以你可能想要检入分配给函数的哪个事件当前完成渲染并调整代码以适应。

source: When adding audio to GameMaker it can be either streamed or in memory.
zh_cn: 当向GameMaker添加音频时，它既可以是流音频也可以是内存音频。

source: When an instance is rendered in GameMaker , the depth of a generated pixel (its z coordinate) is stored in the z-buffer, then, if another instance of the scene must be rendered at the same pixel, the two depths are compared (z-testing - see gpu_set_ztestenable()) and the one "closer" to the observer is then saved to the z-buffer, replacing the old one.
zh_cn: 当一个实例在GameMaker中渲染时，生成的像素的深度(它的z坐标)被存储在z缓冲区中，然后，如果场景的另一个实例必须在相同的像素上渲染，两个深度将被比较(z测试-参见gpu_set_ztestenable())，然后"更接近"观察者的那个被保存到z缓冲区中，取代旧的那个。

source: When applying this to buffers using this function you must specify the buffer id of the buffer to use, then an offset value (in bytes) for where to begin, and then a size (again in bytes) for the region to be hashed.
zh_cn: 当使用此函数将它应用到缓冲区时，您必须指定要使用的缓冲区的缓冲区id，然后指定开始位置的偏移值(以字节为单位)，然后指定要散列的区域的大小(也是以字节为单位)。

source: When assigning a layer, you must supply the unique layer ID as returned by the function layer_get_id() (when using named room layers), or as returned by the function layer_create() (when you create your own layers at run time).
zh_cn: 指定层时，必须提供由函数layer_get_id()返回的唯一层id(使用命名的房间层时)，或由函数layer_create()返回的唯一层ID(在运行时创建自己的层时)。

source: When automatic drawing is off, you can explicitly order GameMaker to draw the current state of the particle system using the function part_system_drawit(), and if you set this function to true again you can switch automatic drawing back on.
zh_cn: 当自动绘图关闭时，您可以使用函数 part_system_drawit() 显式命令 GameMaker 绘制粒子系统的当前状态，如果再次将此函数设置为 true，您可以重新打开自动绘图。

source: When calling the function you supply the unique camera ID value, which you get from the camera_create_* functions or from the view_camera array if using the Room Editor to set up the view port and view.
zh_cn: 调用此函数时，您需要提供唯一的相机ID值，该值可以从camera_create_*函数或view_camera数组(如果使用房间编辑器来设置视口和视图)中获得。

source: When changing rooms, if there is another layer in the following rooms with the same name, then the persisted instance will be assigned to the layer with the that name regardless of the depth of the layer.
zh_cn: 在更改房间时，如果以下房间中有另一个具有相同名称的层，则持久化实例将被分配给具有该名称的层，而不管该层的深度如何。

source: When checking using this function, if the object is a parent, then all child objects will also be included in the return value, and also note that those instances which have been deactivated with the instance deactivate functions will not be included in this check.
zh_cn: 使用此函数检查时，如果对象是父对象，则所有子对象也将包括在返回值中，同时注意，使用实例停用功能停用的那些实例将不包括在此检查中。

source: When comparing values, for example when searching in a map or sorting a list, GameMaker must decide when two values are equal.
zh_cn: 当比较值时，例如在地图中搜索或排序列表时，GameMaker必须决定两个值何时相等。

source: When copying from a vertex buffer into a regular buffer with this function, both buffers must have previously been created (using the vertex_create_buffer() and buffer_create() functions, for example).
zh_cn: 当使用此函数从顶点缓冲区复制到常规缓冲区时，两个缓冲区必须都已创建(例如，使用vertex_create_buffer()和buffer_create()函数)。

source: When created a points struct is empty and you need to set the following variables to generate the point data:
zh_cn: 当创建一个点结构是空的，你需要设置以下变量来生成点数据:

source: When creating a physics system in GameMaker, it is often important to have a visual representation of what is actually happening with an instance.
zh_cn: 在GameMaker中创建物理系统时，拥有一个实例实际发生情况的可视化表示通常很重要。

source: When defining a font in GameMaker, you can define a range of characters to include.
zh_cn: 在GameMaker中定义字体时，你可以定义要包含的字符范围。

source: When developing for mobile devices, you need to have a way to check that the device is still focused on your game or not, especially as if your game is on an iOS, Android or Windows Phone device then it can be interrupted by phone calls and other apps.
zh_cn: 在为移动设备开发时，你需要有一种方法来检查设备是否仍然专注于你的游戏，特别是如果你的游戏是在iOS、Android或Windows Phone设备上，那么它可能会被电话和其他应用程序中断。

source: When enabled (set to true), additional information about texture page use will be sent to the output window.
zh_cn: 当启用时(设置为true)，关于纹理页面使用的附加信息将被发送到输出窗口。

source: When enabled, each tap event will have an additional "tapcount" DS map entry which will have registered the number of taps, and when enabled it means that all tap events will be triggered, ie: two taps will trigger both the single tap event and the double tap event, with the single tap event tap count being 1 and the double tap event tap count being 2.
zh_cn: 启用时，每个点击事件将有一个额外的"点击计数"DS映射条目，该条目将记录点击次数，启用时，这意味着所有点击事件都将被触发，即:两次点击将触发单次点击事件和两次点击事件，其中单次点击事件点击计数为1，两次点击事件点击计数为2。

source: When performing image blending and colouring, HTML5 cannot do it dynamically in the same way an executable could be performed.
zh_cn: 在执行图像混合和着色时，HTML5不能像执行可执行文件那样动态地执行。

source: When performing image blending, HTML5 cannot do it dynamically in the same way an executable could be performed.
zh_cn: 当执行图像混合时，HTML5不能像执行可执行文件那样动态地执行。

source: When set to true tap counting is enabled, and when set to false it is disabled, although you can check which state it is in using the function gesture_get_tap_count().
zh_cn: 当设置为true时，点击计数被启用，当设置为false时，它被禁用，尽管您可以使用函数gesture_get_tap_count()检查它处于哪个状态。

source: When set to true the element sprite will be stretched to fit the room (either scaled up or scaled down depending on the sizes of the sprite and the room), and when set to false, the element sprite will be displayed at its native resolution.
zh_cn: 当设置为true时，元素精灵将被拉伸以适合房间(根据精灵和房间的大小放大或缩小)，当设置为false时，元素精灵将以其原始分辨率显示。

source: When set to true the element will be displayed, and when set to false, the element will not be displayed.
zh_cn: 当设置为true时，将显示该元素，当设置为false时，将不显示该元素。

source: When the arguments are set to true these messages will appear, informing the player of any local or remote challenges received as well as those challenges that have been completed, while setting them to false will suppress these notifications.
zh_cn: 当参数设置为真时，这些消息就会出现，通知玩家收到的任何本地或远程挑战以及已经完成的挑战，而设置为假则会抑制这些通知。

source: When the data being added reaches the limit of the buffer size, the overwrite will be placed back at the start of the buffer, and further writing will continue from that point.
zh_cn: 当添加的数据达到缓冲区大小的限制时，覆盖将被放回到缓冲区的开始处，并且进一步的写入将从该点继续。

source: When the instance would run into a solid instance (or any instance when checkall is true) it will change the direction of motion to try to avoid that instance and move around it.
zh_cn: 当实例遇到实体实例（或 checkall 为真时的任何实例）时，它将改变运动方向以尝试避开该实例并在其周围移动。

source: When the instance would run into an instance of the object specified by the "obj" argument it will change the direction of motion to try to avoid that instance and move around it.
zh_cn: 当实例遇到由"obj"参数指定的对象的实例时，它将改变运动方向，试图避开该实例并绕其移动。

source: When the number of arguments is even, the smaller of the two middle values is returned and the function can have as many arguments as required (note that more arguments will mean that the function will be slower to parse) which must all be real values.
zh_cn: 当参数数量为偶数时，返回两个中间值中较小的那个，函数可以根据需要拥有任意数量的参数(注意，参数越多，函数解析的速度就越慢)，这些参数必须都是实数。

source: When the surface is first created, it may contain "noise" as basically it is just an area of memory that is put aside for the purpose (and that memory may still contain information), so you may want to clear the surface before use with a function like draw_clear_alpha().
zh_cn: 当第一次创建表面时，它可能包含"噪声",因为基本上它只是为此目的而保留的一个内存区域(并且该内存可能仍然包含信息),所以您可能希望在使用draw_clear_alpha()之类的函数之前清除表面。

source: When this is enabled (true) all textures will be smoothed when drawn (this includes sprites as they too are considered textures), meaning that when scaled or moved if there is not a 1:1 pixel ratio then there will be a "smudging" across various pixels which may make images appear blurry depending on the art style used.
zh_cn: 当启用此选项时(true)，所有的纹理在绘制时都将被平滑化(这包括精灵，因为它们也被认为是纹理)，这意味着当缩放或移动时，如果没有1:1的像素比，那么将会在各种像素之间产生"模糊"，这可能会使图像看起来模糊，这取决于所使用的美术风格。

source: When this is enabled (true) the sampler texture will be smoothed and if this is disabled (false) then images will be drawn based on the nearest pixel.
zh_cn: 当启用(true)采样器纹理将被平滑，如果禁用(false)，那么图像将基于最近的像素绘制。

source: When this is on, the first tap will be detected as mb_left, and the second as mb_right, so make sure that any code you use takes this into account.
zh_cn: 启用此选项后，第一次点击将被检测为mb_left，第二次点击将被检测为mb_right，因此请确保您使用的任何代码都考虑到这一点。

source: When used, the key will be flagged as being pressed until the corresponding release function is called (see keyboard_key_release()).
zh_cn: 当使用该键时，该键将被标记为被按下，直到相应的释放函数被调用为止(参见keyboard_key_release())。

source: When using more than a single flag, these need to be merged using the bitwise "or", as shown in the example below.
zh_cn: 当使用多个标志时，需要使用位或(bitwise "or" | )进行合并，如下例所示。

source: When using multiple listeners on a system, you can set the bit-mask for a sound and have it heard from the flagged listener only.
zh_cn: 当在一个系统上使用多个时，您可以为一个声音设置位掩码，并让它只从标记的中听到。

source: When using this feature the game won't autostart and instead require rollback_start_game to be called after all players have set their preferences.
zh_cn: 当使用此函数时，游戏不会自动启动，而是需要在所有玩家都设置好偏好后调用rollback_start_game。

source: When using this function the priority queue being copied to must have been previously created and if it contained any items before the copy, then these will be cleared first (meaning this information will be lost).
zh_cn: 在使用此函数时，要复制的优先级队列必须是以前创建的，如果它在复制之前包含任何项，那么这些项将首先被清除(这意味着该信息将丢失)。

source: When using this function the queue being copied to must have been previously created and if it contained any items before the copy, then these will be cleared first (meaning this information will be lost).
zh_cn: 使用此函数时，要复制到的队列必须是以前创建的，如果它在复制前包含任何项目，则这些项目将首先被清除(意味着此信息将丢失)。

source: When using this function the stack being copied to must have been previously created and if it contained any items before the copy, then these will be cleared first (meaning this information will be lost).
zh_cn: 在使用此函数时，被复制的堆栈必须是之前创建的，如果它包含复制之前的任何项，那么这些项将首先被清除(这意味着这些信息将丢失)。

source: When using this function you should use a sprite index that has been created and stored in a variable using other functions like sprite_add() or sprite_create_from_surface(), or even sprite_duplicate(), rather than a resource tree sprite asset.
zh_cn: 使用此函数时，您应该使用一个sprite索引，该索引是使用sprite_add()或sprite_create_from_surface()或sprite_duplicate()等其他函数创建并存储在变量中的，而不是使用资源树sprite资源。

source: When using this function, numbers, minus signs, decimal points and exponential parts in the string are taken into account, while other characters (such as letters) will cause an error to be thrown.
zh_cn: 使用此函数时，字符串中的数字、减号、小数点和指数部分都将被考虑在内，而其他字符(如字母)将导致抛出错误。

source: When using this function, you define a circular area and GameMaker will work out whether the given point falls within its bounds or not.
zh_cn: 当使用此函数时，你定义一个圆形区域，GameMaker将计算出给定点是否在它的范围内。

source: When using this function, you define a rectangular area and GameMaker will work out whether the given point falls within its bounds or not.
zh_cn: 当使用此函数时，你定义一个矩形区域，GameMaker将计算出给定点是否在其边界内。

source: When using this function, you define a triangular area and GameMaker will work out whether the given point falls within its bounds or not.
zh_cn: 当使用此函数时，你定义一个三角形区域，GameMaker将计算出给定点是否在其边界内。

source: When using two buffers and copying from one to the other, both buffers must have previously been created using the buffer_create() function (for example), and you can specify a data offset (in bytes) for the start point of the data to be copied from the source buffer relative to the start of the buffer, as well as another data offset to define the position to copy the data to in the destination buffer.
zh_cn: 当使用两个缓冲区并从一个缓冲区复制到另一个缓冲区时，这两个缓冲区都必须是先前使用buffer_create()函数创建的(例如),您可以为要从源缓冲区复制的数据的起始点指定一个相对于缓冲区起点的数据偏移量(以字节为单位),并指定另一个数据偏移量来定义要将数据复制到目标缓冲区中的位置。

source: When we talk about torque, we are generally talking about the tendency of a force or impulse to rotate an instance about its centre of mass, but in GameMaker you can also apply torque independently to an instance, causing it to rotate in a given direction.
zh_cn: 当我们谈论扭矩时，我们通常谈论的是力或冲动使实例围绕其质心旋转的趋势，但在GameMaker中，您也可以独立地将扭矩应用于实例，使其沿给定方向旋转。

source: When working on mobile devices (in particular Android devices) this is an important factor to take into consideration as what may be appropriate for one display resolution, may not be appropriate for another.
zh_cn: 在移动设备(特别是Android设备)上工作时，这是需要考虑的一个重要因素，因为适合一种显示分辨率的分辨率可能并不适合另一种分辨率。

source: When working with physics you need to apply not only gravity to objects, but forces as well.
zh_cn: 当研究物理时，你不仅需要对物体施加重力，还要施加力。

source: When working with surfaces, it is often required that you capture the whole visible region of the screen to the surface, and so you would assign it to a view port using this variable.
zh_cn: 在处理表面时，通常需要将屏幕的整个可见区域捕捉到表面上，因此可以使用此变量将其分配给一个视口。

source: When working with surfaces, it is often required to capture the whole visible region of the screen to the surface, and so you would assign it to a view port using this function.
zh_cn: 在处理表面时，通常需要将屏幕的整个可见区域捕捉到表面，因此可以使用此函数将其分配给视图端口。

source: When you are debugging audio in this way, the overlay will show the following information:
zh_cn: 当你用这种方式调试音频时，覆盖层将显示以下信息:

source: When you are finished adding layers or layer elements to a room, call the function layer_reset_target_room() to reset the room target (or call this function again with a room argument of -1).
zh_cn: 当您完成向房间添加图层或图层元素时，调用函数layer_reset_target_room()来重置房间目标(或使用room参数-1再次调用此函数)。

source: When you are working with surfaces, you should always use this function whenever you are finished using them.
zh_cn: 在处理表面时，应该在使用完表面后使用此函数。

source: When you bind a fixture to an instance using physics_fixture_bind() this returns an "id" for the bound fixture.
zh_cn: 当您使用physics_fixture_bind()将夹具绑定到实例时，这将为绑定的夹具返回一个"id"。

source: When you call the function, you need to specify the width and height of the GIF (in pixels, and there is no upper limit on size except for available memory), and the function will return the unique ID value used to identify the gift in subsequent functions, or it will return -1 if the gif could not be initialized (for example, if the width/height are too big for the memory available).
zh_cn: 调用此函数时，需要指定GIF的宽度和高度(以像素为单位，除了可用内存外，大小没有上限)，此函数将返回后续函数中用于标识gif的惟一ID值，或者如果GIF无法初始化(例如，如果宽度/高度对可用内存来说太大)，则返回-1。

source: When you call this function you are telling GameMaker that all further layer functions should be applied to the given room.
zh_cn: 当你调用此函数时，你就是在告诉GameMaker所有进一步的层函数都应该应用到给定的房间。

source: When you call this function you need to provide one of the following constants for each of the first three arguments:
zh_cn: 当您调用此函数时，需要为前三个参数分别提供以下常量之一:

source: When you create a room with no active view ports or view cameras, GameMaker still uses a camera to show the action in the game.
zh_cn: 当您创建一个没有活动视口或相机的房间时，GameMaker仍然使用相机来显示游戏中的动作。

source: When you create a rope joint the two instances should already be created and have a fixture assigned, then you define the two anchor points in room coordinates.
zh_cn: 当您创建一个绳连接时，两个实例应该已经创建并分配了一个夹具，然后在房间坐标中定义两个锚点。

source: When you create an object you can assign it an initial depth which defines how the instances of that object will be drawn in the room when the game is being played and this variable can be used to get and to change that depth value while the game is running.
zh_cn: 当你创建一个对象时，你可以为它分配一个初始深度，这将定义当游戏正在进行时，该对象的实例将如何在房间中绘制，这个变量可以用于在游戏运行时获取和更改深度值。

source: When you create you skeletal animation sprite, you can assign attachment slots and attachments to go in them.
zh_cn: 当你创建你的骨骼动画精灵时，你可以分配附件槽和附件。

source: When you created your sprite (in Spine) you will have defined multiple animations sets for different states and named each of them appropriately.
zh_cn: 当你创建你的精灵时(在《Spine》中)，你将为不同的状态定义多个动画集，并适当地命名它们。

source: When you define a positional or a directional light you must assign it an index number which is then used by this function to switch the light on or off.
zh_cn: 当你定义一个位置灯或方向灯时，你必须给它指定一个索引号，然后此函数使用这个索引号来打开或关闭灯光。

source: When you define a sprite in the sprite editor, you need to set the origin for that sprite.
zh_cn: 在精灵编辑器中定义精灵时，需要设置精灵的原点。

source: When you define an audio group in the Game Options, you give it a unique "name" which is really a constant to use as an ID value for the group.
zh_cn: 当你在Game Options中定义一个音频组时，你给它一个唯一的"名称"，这是一个常量，用作组的ID值。
